import pandas as pd
laic_charge_match = {
    '串通投标': [
        ('串通', '投标')
    ],
    '伪造公司、企业、事业单位、人民团体印章': [
        ('伪造', '印章'),
        ('伪造', '公章'),
    ],
    '侵犯著作权': [
        ('侵犯', '著作权')
    ],
    '假冒注册商标': [
        ('假冒', '商标')
    ],
    '出售、购买、运输假币': [
        ('出售', '假币'), ('购买', '假币'), ('运输', '假币')
    ],
    '制作、复制、出版、贩卖、传播淫秽物品牟利': [
        ('淫秽')
    ],
    '受贿': [
        ('受贿')
    ],
    '失火': [
        ('火灾')
    ],
    '强迫交易': [
        ('强迫', '交易')
    ],
    '扰乱无线电通讯管理秩序': [
        ('无线电')
    ],
    '投放危险物质': [
        ('投放', '危险', '物质')
    ],
    '抢劫': [
        ('抢劫')
    ],
    '拐卖妇女、儿童': [
        ('拐卖', '妇女'), ('拐卖', '儿童'), ('贩卖', '妇女'), ('贩卖', '儿童'), ('贩卖', '婴儿')
    ],
    '招摇撞骗': [
        ('招摇', '撞骗'),
    ],
    '持有、使用假币': [
        ('持有', '假币'), ('使用', '假币')
    ],
    '持有伪造的发票': [
        ('持有', '伪造', '发票')
    ],
    '挪用公款': [
        ('挪用', '公款')
    ],
    '挪用资金': [
        ('挪用', '资金')
    ],
    '盗掘古文化遗址、古墓葬': [
        ('盗掘', '遗址'), ('盗掘', '古墓'), ('盗挖', '遗址'), ('盗挖', '古墓')
    ],
    '破坏生产经营': [
        ('破坏', '生产'), ('破坏', '经营'),
    ],
    '窝藏、包庇': [
        ('窝藏'), ('包庇')
    ],
    '组织、领导传销活动': [
        ('组织', '传销'), ('领导', '传销')
    ],
    '绑架': [
        ('绑架')
    ],
    '聚众斗殴': [
        ('聚众斗殴')
    ],
    '虚开发票': [
        ('虚假', '发票'), ('虚开', '发票'), ('伪造', '发票')
    ],
    '虚开增值税专用发票、用于骗取出口退税、抵扣税款发票': [
        ('虚开', '增值税', '发票'), ('虚开', '退税', '发票'), ('虚开', '抵扣税款', '发票'),
        ('虚假', '增值税', '发票'), ('虚假', '退税', '发票'), ('虚假', '抵扣税款', '发票'),
        ('伪造', '增值税', '发票'), ('伪造', '退税', '发票'), ('伪造', '抵扣税款', '发票')
    ],
    '诈骗': [
        ('诈骗')
    ],
    '走私、贩卖、运输、制造毒品': [
        ('走私', '毒品'), ('贩卖', '毒品'), ('运输', '毒品'), ('制造', '毒品'), ('买卖', '毒品')
    ],
    '走私普通货物、物品': [
        ('走私')
    ],
    '过失致人死亡': [
        ('过失', '死亡')
    ],
    '过失致人重伤': [
        ('过失', '重伤')
    ],
    '违法发放贷款': [
        ('发放', '贷款')
    ],
    '重婚': [
        ('重婚')
    ],
    '非法制造、买卖、运输、邮寄、储存枪支、弹药、爆炸物': [
        ('制造', '枪支'), ('买卖', '枪支'), ('运输', '枪支'), 
        ('邮寄', '枪支'), ('储存', '枪支'), ('制造', '弹药'), 
        ('买卖', '弹药'), ('运输', '弹药'), ('邮寄', '弹药'), 
        ('储存', '弹药'), ('制造', '爆炸'), ('买卖', '爆炸'), 
        ('运输', '爆炸'), ('邮寄', '爆炸'), ('储存', '爆炸'),
        ('买', '枪支'), ('买', '弹药'), ('买', '爆炸'), 
        ('卖', '枪支'), ('卖', '弹药'), ('卖', '爆炸'), 
    ],
    '非法占用农用地': [
        ('占用', '农用地'),
    ],
    '非法处置查封、扣押、冻结的财产': [
        ('查封', '财产'), ('扣押', '财产'), ('冻结', '财产')
    ],
    '非法持有、私藏枪支、弹药': [
        ('持有', '枪支'), ('携带', '枪支'), ('私藏', '枪支'),
        ('持有', '弹药'), ('携带', '弹药'), ('私藏', '弹药')
    ],
    '非法持有毒品': [
        ('持有', '毒品'),
    ],
    '非法生产、买卖、运输制毒物品、走私制毒物品': [
        ('生产', '制毒物品'), ('买卖', '制毒物品'), ('运输', '制毒物品'), ('走私', '制毒物品')
    ],
    '非法经营': [
        ('非法', '经营'),
    ],
    '非法转让、倒卖土地使用权': [
        ('转让', '土地'), ('倒卖', '土地')
    ]
}
cail_charge_match = {
    '以危险方法危害公共安全': [
        ('危害', '公共', '安全'),     
    ],
    '故意伤害': [
        ('故意', '伤害'),
    ],
    '骗取贷款、票据承兑、金融票证': [
        ('骗', '贷款'), ('骗', '票'),
    ],
    '生产、销售有毒、有害食品': [
        ('生产', '有害', '食'), ('生产', '有毒', '食'),
        ('销售', '有害', '食'), ('销售', '有毒', '食'),
    ],
    '信用卡诈骗': [
        ('信用卡', '诈骗'),
    ],
    '掩饰、隐瞒犯罪所得、犯罪所得收益': [
        ('掩饰', '所得'), ('隐瞒', '所得'),
    ],
    '盗窃': [
        ('盗窃'),
    ],
    '单位行贿': [
        ('单位', '行贿'),
    ],
    '非国家工作人员受贿': [
        ('非', '国家', '工作', '贿'),
    ],
    '非法捕捞水产品': [
        ('捕', '水', '产品'), ('捞', '水', '产品'),
    ],
    '非法拘禁': [
        ('拘禁'),
    ],
    '销售假冒注册商标的商品': [
        ('售', '假', '商品'),
        ('卖', '假', '商品'),
    ],
    '重大劳动安全事故': [
        ('劳动', '事故'),
    ],
    '容留他人吸毒': [
        ('容留', '吸毒'),
    ],
    '非法种植毒品原植物': [
        ('种', '毒品'),
        ('植', '毒品'),
    ],
    '盗伐林木': [
        ('盗',' 伐', '林'),
        ('盗',' 伐', '木'),
        ('偷',' 伐', '林'),
        ('偷',' 伐', '木'),
    ],
    '故意杀人': [
        ('故意', '杀人'),
    ],
    '交通肇事': [
        ('肇事'),
    ],
    '污染环境': [
        ('污染', ),
    ],
    '强奸': [
        ('强奸'),
    ],
    '合同诈骗': [
        ('合同', '诈骗'),
    ],
    '生产、销售不符合安全标准的食品': [
        ('产', '不', '安全', '食'),
        ('售', '不', '安全', '食'),
        ('卖', '不', '安全', '食'),
    ],
    '强制猥亵、侮辱妇女': [
        ('猥亵', '女'), ('侮辱', '女'),
    ],
    '妨害信用卡管理': [
        ('信用卡', '管理'),
    ],
    '赌博': [
        ('赌博'),
    ],
    '生产、销售伪劣产品': [
        ('产', '伪', '品'), ('产', '劣', '品'),
        ('售', '伪', '品'), ('售', '劣', '品'),
        ('卖', '伪', '品'), ('卖', '劣', '品'),
    ],
    '妨害公务': [
        ('妨', '公务'),
    ],
    '职务侵占': [
        ('职务', '侵'), ('职务', '占'),
    ],
    '非法采矿': [
        ('采矿'),
    ],
    '寻衅滋事': [
        ('寻衅'), ('滋事'),
    ],
    '非法行医': [
        ('行医'), 
    ],
    '非法侵入住宅': [
        ('侵', '住宅'), ('入', '住宅'),
        ('侵', '房'), ('入', '房'),
    ],
    '重大责任事故': [
        ('责任', '事故'), 
    ],
    '非法猎捕、杀害珍贵、濒危野生动物': [
        ('猎', '动物'), ('猎', '濒危'), ('猎', '野生'), 
        ('捕', '动物'), ('捕', '濒危'), ('捕', '野生'), 
        ('杀', '动物'), ('杀', '濒危'), ('杀', '野生'), 
        ('害', '动物'), ('害', '濒危'), ('害', '野生'), 
    ],
    '抢夺': [
        ('抢夺'),
    ],
    '滥用职权': [
        ('滥用', '职'), ('滥用', '权'),
    ],
    '破坏广播电视设施、公用电信设施': [
        ('破坏', '广播'), ('破坏', '电信'), 
    ],
    '放火': [
        ('放火'),
    ],
    '伪造、变造、买卖国家机关公文、证件、印章': [
        ('伪造', '印章'),
        ('伪造', '公章'),
    ],
    '非法采伐、毁坏国家重点保护植物': [
        ('采', '保护', '植'),
        ('伐', '保护', '植'),
        ('毁', '保护', '植'),
        ('坏', '保护', '植'),
    ],    
    '开设赌场': [
        ('开', '赌场'), ('开', '设'),
    ],
    '生产、销售假药': [
        ('产', '假', '药'),('售', '假', '药'),('卖', '假', '药'),
    ],   
    '非法吸收公众存款': [
        ('吸', '公众', '款'),
        ('收', '公众', '款'),
    ],
    '玩忽职守': [
        ('忽', '职守'),
    ],   
    '拒不支付劳动报酬': [
        ('拒', '付', '劳动', '酬'),
        ('不', '付', '劳动', '酬'),
        ('拒', '付', '劳动', '钱'),
        ('不', '付', '劳动', '钱'),
        ('拒', '付', '劳动', '款'),
        ('不', '付', '劳动', '款'),
    ],   
    '危险驾驶': [
        ('危险', '驾驶'), 
    ],
    '破坏电力设备': [
        ('破坏',' 电', '设备'),
    ], 
    '敲诈勒索': [
        ('敲诈'), ('勒索'),
    ],
    '拒不执行判决、裁定': [
        ('拒', '执行', '判决'),
        ('不', '执行', '判决'),
        ('拒', '执行', '裁定'),
        ('不', '执行', '裁定'),
    ],
    '故意毁坏财物': [
        ('毁', '财'), ('坏', '财'),
    ],
    '滥伐林木': [
        ('滥',' 伐', '林'),
        ('滥',' 伐', '木'),
    ], 
    '非法收购、运输、加工、出售国家重点保护植物、国家重点保护植物制品': [
        ('购',' 国家', '保护', '植'),
        ('运',' 国家', '保护', '植'),
        ('加工',' 国家', '保护', '植'),
        ('售',' 国家', '保护', '植'),
        ('卖',' 国家', '保护', '植'),
    ], 
    '猥亵儿童': [
        ('猥亵','儿'),
        ('猥亵','童'),
    ], 
    '非法狩猎': [
        ('狩猎'),
    ], 
    '贪污': [
        ('贪污'),
    ], 
    '行贿': [
        ('行贿'),
    ], 
}
total_charge_match = {**laic_charge_match, **cail_charge_match} 


import json
def get_charge_labels():
    df = pd.read_csv('/data/apps/lacode/self-correct-retriever/data/back_up/laic2021.csv')
    # 统计每个罪名的数量
    charge = list(df['charge'])
    # with open(testset_path, encoding="utf8") as f:
    #     for line in f.readlines():
    #         obj = json.loads(line)
    #         data.append(obj)
    # charges = [case["meta"]["accusation"][0].replace("[","").replace("]","") for case in data]
    c_set = set(charge)
    return c_set

def get_similar_charge(text):
#     print(text)
    contain_charge_set = set()
    for c, sc_lst in total_charge_match.items():
        for sc_words in sc_lst:
            if sum([w in text for w in sc_words]) == len(sc_words):
                contain_charge_set.add(c)
    if len(contain_charge_set) == 0:
        return "#"
    charge_set = list(contain_charge_set)
    charge_set = sorted(charge_set, key = lambda x: len(x), reverse = True)
    return charge_set